import type {quoteItem} from "./components/types.ts";

export const quotes: quoteItem[] = [
    {
        id: 1,
        body: `Он всегда... пытается быть лучше всех, чтобы люди признали его... Ради этой мечты, он всегда готов рисковать своей жизнью. Ему, вероятно, надоело плакать. И тогда он понял, что это лучший способ стать сильным. Так же как твой отец. Наруто может понять твои страдания больше, чем кто-либо другой. То, что он сказал тебе раньше, вероятно, говорил себе много раз.`,
        author: "Какаши"
    },
    {
        id: 2,
        body: "Да, в мире шиноби те, кто не следуют приказам, считаются мусором. Но те, кто предают друзей, хуже мусора...",
        author: "Обито"
    },
    {
        id: 3,
        body: "Все люди делятся на гениев и тех, кто всего добивается своим трудом.",
        author: "Ли"
    },
    {
        id: 4,
        body: "Принадлежность к организации, принадлежность к клану... Зачем вообще кому-то принадлежать? Это мерзко, ограничивать себя и свой сосуд. Теперь я это понимаю. Люди боятся и ненавидят тех, кого не понимают. Глупцы.",
        author: "Итачи"
    },
    {
        id: 5,
        body: "Никогда не отказываться от своих слов... и никогда не сдаваться. Таков твой путь ниндзя... и я, как твой наставник... не имею права скулить! Потому что... путь ниндзя ученика должен быть и путем ниндзя наставника тоже! Верно, Наруто?!",
        author: "Джирая"
    }
]